"""Даны 2 числа a и b. Получить их сумму, разность и произведение"""

a = 1
b = 3

c = a + b
d = a - b
e = a * b

print(f'Сумма чисел {a} и {b} равна {c}')
print(f'Разность чисел {a} и {b} равна {d}')
print(f'Произведение чисел {a} и {b} равно {e}')
